chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usbhs/processor/usbhs_p32mz2048ech124.h
PLIB_INLINE_API void PLIB_USBHS_HostRxEndpointDataToggleClear(USBHS_MODULE_ID index, uint8_t hostEndpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_HostRxEndpointDataToggleClear_Default(index, hostEndpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceRxEndpointConfigure(USBHS_MODULE_ID index, uint8_t endpoint, uint16_t endpointSize, uint16_t fifoAddress, uint8_t fifoSize, uint32_t transferType)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceRxEndpointConfigure_Default(index, endpoint, endpointSize, fifoAddress, fifoSize, transferType);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceTxEndpointConfigure(USBHS_MODULE_ID index, uint8_t endpoint, uint16_t endpointSize, uint16_t fifoAddress, uint8_t fifoSize, uint32_t transferType)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceTxEndpointConfigure_Default(index, endpoint, endpointSize, fifoAddress, fifoSize, transferType);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceRxEndpointStallEnable(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceRxEndpointStallEnable_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceTxEndpointStallEnable(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceTxEndpointStallEnable_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceRxEndpointStallDisable(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceRxEndpointStallDisable_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceTxEndpointStallDisable(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceTxEndpointStallDisable_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USBHS_DeviceTxEndpointPacketReady(USBHS_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USBHS_ID_0 :
            USBHS_DeviceTxEndpointPacketReady_Default(index, endpoint);
            break;
        case USBHS_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USBHS_ExistsEndpointOperations(USBHS_MODULE_ID index)
{
    switch (index) {
        case USBHS_ID_0 :
            return USBHS_ExistsEndpointOperations_Default(index);
        case USBHS_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

#endif
